In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Mac OS

In [4]:
import pandas as pd

In [5]:
import numpy as np

# 1. 접합하기

## concat 함수 사용하기

In [6]:
s1 = pd.Series(np.arange(5))

In [7]:
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [8]:
s2 = pd.Series(np.arange(6,11))

In [9]:
s2

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [10]:
s3 = pd.concat([s1,s2])

In [11]:
s3

0     0
1     1
2     2
3     3
4     4
0     6
1     7
2     8
3     9
4    10
dtype: int64

## index 값 무시하기 : 새로운 인덱스 생성하기

In [12]:
s4 = pd.concat([s1,s2], ignore_index=True)

In [13]:
s4

0     0
1     1
2     2
3     3
4     4
5     6
6     7
7     8
8     9
9    10
dtype: int64

## 데이터프레임은 축이 두개이므로 축별로 접합하기

### 두 개의 데이터프레임 생성하기

In [14]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),
                   columns=['a','b','c'])

In [15]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [16]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3),
                   columns=['a','c','d'])

###  행을 기준으로 처리하기

In [17]:
df3 = pd.concat([df1, df2], axis=1)

In [18]:
df3

   a  b  c  a  c  d
0  0  1  2  0  1  2
1  3  4  5  3  4  5
2  6  7  8  6  7  8

###  인덱스 기준은 join 기준이 outer

In [19]:
df3_outer = pd.concat([df1, df2], axis=1, join='outer')

In [20]:
df3_outer

   a  b  c  a  c  d
0  0  1  2  0  1  2
1  3  4  5  3  4  5
2  6  7  8  6  7  8

### 조인처리를 변경해서 알아보기

In [21]:
df2_idx  = df2.copy()

In [22]:
df2_idx.index = [0,2,3]

In [23]:
df2_inner = pd.concat([df2_idx, df1], axis=1,join='inner')

In [24]:
df2_inner

   a  c  d  a  b  c
0  0  1  2  0  1  2
2  3  4  5  6  7  8

In [25]:
df2_outer = pd.concat([df2_idx, df1], axis=1, join='outer')

In [26]:
df2_outer

     a    c    d    a    b    c
0  0.0  1.0  2.0  0.0  1.0  2.0
1  NaN  NaN  NaN  3.0  4.0  5.0
2  3.0  4.0  5.0  6.0  7.0  8.0
3  6.0  7.0  8.0  NaN  NaN  NaN

### 열을 기준으로 처리하기

      동일한 열의 이름이 존재하므로 sort=True 를 지정해서 동일한 열의 값들이 들어오도록 지정해야 함

In [27]:
df4 = pd.concat([df1, df2], axis=0, sort=True)

In [28]:
df4

   a    b  c    d
0  0  1.0  2  NaN
1  3  4.0  5  NaN
2  6  7.0  8  NaN
0  0  NaN  1  2.0
1  3  NaN  4  5.0
2  6  NaN  7  8.0

### 인덱스를 무시하고 재생성하기

In [29]:
df5 = pd.concat([df1, df2], axis=0, sort=True, ignore_index=True)

In [30]:
df5

   a    b  c    d
0  0  1.0  2  NaN
1  3  4.0  5  NaN
2  6  7.0  8  NaN
3  0  NaN  1  2.0
4  3  NaN  4  5.0
5  6  NaN  7  8.0

# 2.  덧붙이기

### sort=True를 지정해서 덧 붙이기

In [31]:
df6 = df1.append(df2, sort=True)

In [32]:
df6

   a    b  c    d
0  0  1.0  2  NaN
1  3  4.0  5  NaN
2  6  7.0  8  NaN
0  0  NaN  1  2.0
1  3  NaN  4  5.0
2  6  NaN  7  8.0

In [33]:
df7 = df1.append(df2, sort=True, ignore_index=True)

In [34]:
df7

   a    b  c    d
0  0  1.0  2  NaN
1  3  4.0  5  NaN
2  6  7.0  8  NaN
3  0  NaN  1  2.0
4  3  NaN  4  5.0
5  6  NaN  7  8.0